micropython/micropython/stmhal/hal/l4/src/stm32l4xx_hal_i2c.c
    /* If a pending TXIS flag is set */
    /* Write a dummy data in TXDR */
    if(__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_TXIS) != RESET)
    {
       hi2c->Instance->TXDR = 0x00;
    }
  }
  else if(__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_RXNE) != RESET)
  {
    /* Read data from RXDR */
    (*hi2c->pBuffPtr++) = hi2c->Instance->RXDR;
    hi2c->XferSize--;
    hi2c->XferCount--;
  }
  else if(__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_TXIS) != RESET)
  {
    /* Write data to TXDR */
    hi2c->Instance->TXDR = (*hi2c->pBuffPtr++);
    hi2c->XferSize--;
    hi2c->XferCount--;	
  }
  else if(__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_TCR) != RESET)
  {
    if((hi2c->XferSize == 0)&&(hi2c->XferCount!=0))
    {
      DevAddress = (hi2c->Instance->CR2 & I2C_CR2_SADD);
      
      if(hi2c->XferCount > 255)
      {
        I2C_TransferConfig(hi2c, DevAddress, 255, I2C_RELOAD_MODE, I2C_NO_STARTSTOP);
        hi2c->XferSize = 255;
      }
      else
      {
        hi2c->XferSize = hi2c->XferCount;
        if(hi2c->XferOptions != I2C_NO_OPTION_FRAME)
        {
          I2C_TransferConfig(hi2c, DevAddress, hi2c->XferSize, hi2c->XferOptions, I2C_NO_STARTSTOP);
        }
        else
        {
          I2C_TransferConfig(hi2c, DevAddress, hi2c->XferSize, I2C_AUTOEND_MODE, I2C_NO_STARTSTOP);
        }
      }
    }
    else
    {
      /* Call TxCpltCallback() if no stop mode is set */
      if((I2C_GET_STOP_MODE(hi2c) != I2C_AUTOEND_MODE)&&(hi2c->Mode == HAL_I2C_MODE_MASTER))
      {
        hi2c->Mode = HAL_I2C_MODE_NONE;

        if (hi2c->State == HAL_I2C_STATE_BUSY_TX)
        {
          hi2c->State = HAL_I2C_STATE_READY;
          hi2c->PreviousState = I2C_STATE_MASTER_BUSY_TX;

          /* Disable Interrupts */
          I2C_Disable_IRQ(hi2c, I2C_XFER_TX_IT);

          /* Process Unlocked */
          __HAL_UNLOCK(hi2c);

          /* Call the corresponding callback to inform upper layer of End of Transfer */
            HAL_I2C_MasterTxCpltCallback(hi2c);
        }
        /* hi2c->State == HAL_I2C_STATE_BUSY_RX */
        else
        {
          hi2c->State = HAL_I2C_STATE_READY;
          hi2c->PreviousState = I2C_STATE_MASTER_BUSY_RX;

          /* Disable Interrupts */
          I2C_Disable_IRQ(hi2c, I2C_XFER_RX_IT);

          /* Process Unlocked */
          __HAL_UNLOCK(hi2c);

          /* Call the corresponding callback to inform upper layer of End of Transfer */
          HAL_I2C_MasterRxCpltCallback(hi2c);
        }
      }
      else
      {
        hi2c->PreviousState = I2C_STATE_NONE;
        hi2c->State = HAL_I2C_STATE_READY;
        hi2c->Mode = HAL_I2C_MODE_NONE;

        /* Process Unlocked */
        __HAL_UNLOCK(hi2c);

        /* Wrong size Status regarding TCR flag event */
        hi2c->ErrorCode |= HAL_I2C_ERROR_SIZE;
        HAL_I2C_ErrorCallback(hi2c);
      }
    }
  }
  else if(__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_TC) == SET)
  {
    if(hi2c->XferCount == 0)
    {
      if((I2C_GET_STOP_MODE(hi2c) != I2C_AUTOEND_MODE)&&(hi2c->Mode == HAL_I2C_MODE_MASTER))
      {
        hi2c->Mode = HAL_I2C_MODE_NONE;

        /* No Generate Stop, to permit restart mode */
        /* The stop will be done at the end of transfer, when I2C_AUTOEND_MODE enable */
        if (hi2c->State == HAL_I2C_STATE_BUSY_TX)
        {
          hi2c->PreviousState = I2C_STATE_MASTER_BUSY_TX;
          hi2c->State = HAL_I2C_STATE_READY;

          /* Disable Interrupts */
          I2C_Disable_IRQ(hi2c, I2C_XFER_TX_IT);

          /* Process Unlocked */
          __HAL_UNLOCK(hi2c);

          /* Call the corresponding callback to inform upper layer of End of Transfer */
          HAL_I2C_MasterTxCpltCallback(hi2c);
        }
        /* hi2c->State == HAL_I2C_STATE_BUSY_RX */
        else
        {
          hi2c->PreviousState = I2C_STATE_MASTER_BUSY_RX;
          hi2c->State = HAL_I2C_STATE_READY;

          /* Disable Interrupts */
          I2C_Disable_IRQ(hi2c, I2C_XFER_RX_IT);

          /* Process Unlocked */
          __HAL_UNLOCK(hi2c);

          /* Call the corresponding callback to inform upper layer of End of Transfer */
          HAL_I2C_MasterRxCpltCallback(hi2c);
        }
      }
    }
    else
    {
      /* Process Unlocked */
      __HAL_UNLOCK(hi2c);
      
      /* Wrong size Status regarding TC flag event */
      hi2c->ErrorCode |= HAL_I2C_ERROR_SIZE;

      /* Process Unlocked */
      __HAL_UNLOCK(hi2c);

      /* Call the corresponding callback to inform upper layer of End of Transfer */
      HAL_I2C_ErrorCallback(hi2c);
    }
  }

  if(__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_STOPF) != RESET)
  {
    if(hi2c->State == HAL_I2C_STATE_BUSY_TX)
    {
      if(__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_AF) == SET)
      {
        /* Clear NACK Flag */
        __HAL_I2C_CLEAR_FLAG(hi2c, I2C_FLAG_AF);

        hi2c->ErrorCode |= HAL_I2C_ERROR_AF;

        /* If a pending TXIS flag is set */
        /* Write a dummy data in TXDR to clear it */
        if(__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_TXIS) != RESET)
        {
           hi2c->Instance->TXDR = 0x00;
        }
      }

      /* Disable Interrupts */
      I2C_Disable_IRQ(hi2c, I2C_XFER_TX_IT);

      /* Clear STOP Flag */
      __HAL_I2C_CLEAR_FLAG(hi2c, I2C_FLAG_STOPF);

      /* Clear Configuration Register 2 */
      I2C_RESET_CR2(hi2c);

      /* Flush TX register if not empty */
      if(__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_TXE) == RESET)
      {
        __HAL_I2C_CLEAR_FLAG(hi2c, I2C_FLAG_TXE);
      }

      /* Call the corresponding callback to inform upper layer of End of Transfer */
      if(hi2c->ErrorCode != HAL_I2C_ERROR_NONE)
      {
        hi2c->PreviousState = I2C_STATE_NONE;
        hi2c->State = HAL_I2C_STATE_READY;
        hi2c->Mode = HAL_I2C_MODE_NONE;

        /* Process Unlocked */
        __HAL_UNLOCK(hi2c);

        /* Call the corresponding callback to inform upper layer of End of Transfer */
        HAL_I2C_ErrorCallback(hi2c);
      }
      else
      {
        if (hi2c->Mode == HAL_I2C_MODE_MEM)
        {
          hi2c->PreviousState = I2C_STATE_NONE;
          hi2c->State = HAL_I2C_STATE_READY;
          hi2c->Mode = HAL_I2C_MODE_NONE;

          /* Process Unlocked */
          __HAL_UNLOCK(hi2c);

          /* Call the corresponding callback to inform upper layer of End of Transfer */
          HAL_I2C_MemTxCpltCallback(hi2c);
        }
        else
        {
          hi2c->PreviousState = I2C_STATE_MASTER_BUSY_TX;
          hi2c->State = HAL_I2C_STATE_READY;
          hi2c->Mode = HAL_I2C_MODE_NONE;

          /* Process Unlocked */
          __HAL_UNLOCK(hi2c);

          /* Call the corresponding callback to inform upper layer of End of Transfer */
          HAL_I2C_MasterTxCpltCallback(hi2c);
        }
      }
    }
    else if(hi2c->State == HAL_I2C_STATE_BUSY_RX)
    {
      if(__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_AF) == SET)
      {
        /* Clear NACK Flag */
        __HAL_I2C_CLEAR_FLAG(hi2c, I2C_FLAG_AF);

        hi2c->ErrorCode |= HAL_I2C_ERROR_AF;
      }

      /* Disable Interrupts */
      I2C_Disable_IRQ(hi2c, I2C_XFER_RX_IT);

      /* Clear STOP Flag */
      __HAL_I2C_CLEAR_FLAG(hi2c, I2C_FLAG_STOPF);

      /* Clear Configuration Register 2 */
      I2C_RESET_CR2(hi2c);

      /* Call the corresponding callback to inform upper layer of End of Transfer */
      if(hi2c->ErrorCode != HAL_I2C_ERROR_NONE)
      {
        hi2c->PreviousState = I2C_STATE_NONE;
        hi2c->State = HAL_I2C_STATE_READY;
        hi2c->Mode = HAL_I2C_MODE_NONE;

        /* Process Unlocked */
        __HAL_UNLOCK(hi2c);

        HAL_I2C_ErrorCallback(hi2c);
      }
      else
      {
        if (hi2c->Mode == HAL_I2C_MODE_MEM)
        {
          hi2c->PreviousState = I2C_STATE_NONE;
          hi2c->State = HAL_I2C_STATE_READY;
          hi2c->Mode = HAL_I2C_MODE_NONE;

          /* Process Unlocked */
          __HAL_UNLOCK(hi2c);
      
          HAL_I2C_MemRxCpltCallback(hi2c);
        }
        else
        {
          hi2c->PreviousState = I2C_STATE_MASTER_BUSY_RX;
          hi2c->State = HAL_I2C_STATE_READY;
          hi2c->Mode = HAL_I2C_MODE_NONE;

          /* Process Unlocked */
          __HAL_UNLOCK(hi2c);

