micropython/micropython/stmhal/hal/l4/src/stm32l4xx_hal_i2c.c
          HAL_I2C_MasterRxCpltCallback(hi2c);
        }
      }
    }
  }

  /* Process Unlocked */
  __HAL_UNLOCK(hi2c);

  return HAL_OK;
}

/**
  * @brief  Interrupt Sub-Routine which handle the Interrupt Flags Slave Mode.
  * @param  hi2c Pointer to a I2C_HandleTypeDef structure that contains
  *                the configuration information for the specified I2C.
  * @retval HAL status
  */
static HAL_StatusTypeDef I2C_Slave_ISR(I2C_HandleTypeDef *hi2c) 
{
  uint8_t TransferDirection = 0;
  uint16_t SlaveAddrCode = 0;
  uint16_t OwnAdd1Code = 0;
  uint16_t OwnAdd2Code = 0;

  /* Process locked */
  __HAL_LOCK(hi2c);
  
  if(__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_AF) != RESET)
  {
    /* Check that I2C transfer finished */
    /* if yes, normal use case, a NACK is sent by the MASTER when Transfer is finished */
    /* Mean XferCount == 0*/
    /* So clear Flag NACKF only */
    if(hi2c->XferCount == 0)
    {
      if(((hi2c->XferOptions == I2C_FIRST_AND_LAST_FRAME) || (hi2c->XferOptions == I2C_LAST_FRAME)) && \
        (hi2c->State == HAL_I2C_STATE_LISTEN))
      {
        hi2c->XferOptions = I2C_NO_OPTION_FRAME;

        hi2c->PreviousState = I2C_STATE_NONE;
        hi2c->State = HAL_I2C_STATE_READY;
        hi2c->Mode = HAL_I2C_MODE_NONE;

        /* Store Last receive data if any */
        if(__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_RXNE) == SET)
        {
          /* Read data from RXDR */
          (*hi2c->pBuffPtr++) = hi2c->Instance->RXDR;
          hi2c->XferSize--;
          hi2c->XferCount--;
        }

        /* Disable all Interrupts*/
        I2C_Disable_IRQ(hi2c, I2C_XFER_LISTEN_IT | I2C_XFER_RX_IT | I2C_XFER_TX_IT);

        /* Clear NACK Flag */
        __HAL_I2C_CLEAR_FLAG(hi2c, I2C_FLAG_AF);

        /* Process Unlocked */
        __HAL_UNLOCK(hi2c);

        /* Call the Listen Complete callback, to inform upper layer of the end of Listen usecase */
        HAL_I2C_ListenCpltCallback(hi2c);
      }
      else if((hi2c->XferOptions != I2C_NO_OPTION_FRAME) && (hi2c->State == HAL_I2C_STATE_BUSY_TX_LISTEN))
      {
        /* Last Byte is Transmitted */
        /* Remove HAL_I2C_STATE_SLAVE_BUSY_TX, keep only HAL_I2C_STATE_LISTEN */
        hi2c->PreviousState = I2C_STATE_SLAVE_BUSY_TX;
        hi2c->State = HAL_I2C_STATE_LISTEN;
        hi2c->Mode = HAL_I2C_MODE_NONE;

        /* Disable all Interrupts*/
        I2C_Disable_IRQ(hi2c, I2C_XFER_TX_IT);

        /* Clear NACK Flag */
        __HAL_I2C_CLEAR_FLAG(hi2c, I2C_FLAG_AF);

        /* Check if TXIS flag is SET */
        if(__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_TXIS) != RESET)
        {
          /* Send a dummy data, to clear TXIS event */
          hi2c->Instance->TXDR = 0x00;

          /* Flush TX register if not empty */
          if(__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_TXE) == RESET)
          {
            __HAL_I2C_CLEAR_FLAG(hi2c, I2C_FLAG_TXE);
          }
        }
        
        /* Process Unlocked */
        __HAL_UNLOCK(hi2c);

        /* Call the Tx complete callback to inform upper layer of the end of transmit process */
        HAL_I2C_SlaveTxCpltCallback(hi2c);
      }
      else
      {
        /* Clear NACK Flag */
        __HAL_I2C_CLEAR_FLAG(hi2c, I2C_FLAG_AF);

        /* Process Unlocked */
        __HAL_UNLOCK(hi2c);
      }
    }
    else
    {
      /* if no, error use case, a Non-Acknowledge of last Data is generated by the MASTER*/
      /* Clear NACK Flag */
      __HAL_I2C_CLEAR_FLAG(hi2c, I2C_FLAG_AF);

      if(hi2c->XferOptions != I2C_NO_OPTION_FRAME)
      { 
        /* Set HAL State to "Idle" State, mean to LISTEN state */
        /* So reset Slave Busy state */
        hi2c->PreviousState = I2C_STATE_NONE;
        hi2c->State = HAL_I2C_STATE_LISTEN;
        hi2c->Mode = HAL_I2C_MODE_NONE;

        /* Disable RX/TX Interrupts, keep only ADDR Interrupt */
        I2C_Disable_IRQ(hi2c, I2C_XFER_RX_IT | I2C_XFER_TX_IT);
      }

      /* Set ErrorCode corresponding to a Non-Acknowledge */
      hi2c->ErrorCode |= HAL_I2C_ERROR_AF;

      /* Process Unlocked */
      __HAL_UNLOCK(hi2c);

      /* Call the Error callback to prevent upper layer */
      HAL_I2C_ErrorCallback(hi2c);
    }
  }
  else if(__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_RXNE) != RESET)
  {
    /* Read data from RXDR */
    (*hi2c->pBuffPtr++) = hi2c->Instance->RXDR;
    hi2c->XferSize--;
    hi2c->XferCount--;

    if((hi2c->XferCount == 0)&&(hi2c->XferOptions != I2C_NO_OPTION_FRAME))
    {
        /* Last Byte is received, disable Interrupt */
        I2C_Disable_IRQ(hi2c, I2C_XFER_RX_IT);

        /* Remove HAL_I2C_STATE_SLAVE_BUSY_RX, keep only HAL_I2C_STATE_LISTEN */
        hi2c->PreviousState = I2C_STATE_SLAVE_BUSY_RX;
        hi2c->State = HAL_I2C_STATE_LISTEN;
        hi2c->Mode = HAL_I2C_MODE_NONE;
          
        /* Process Unlocked */
        __HAL_UNLOCK(hi2c);

        /* Call the Rx complete callback to inform upper layer of the end of receive process */
        HAL_I2C_SlaveRxCpltCallback(hi2c);
    }

    if((hi2c->XferCount == 0)                     && \
       (hi2c->XferOptions != I2C_NO_OPTION_FRAME) && \
       (hi2c->State == HAL_I2C_STATE_BUSY_RX_LISTEN))
    {
      /* Last Byte is received, disable Interrupt */
      I2C_Disable_IRQ(hi2c, I2C_XFER_RX_IT);

      /* Remove HAL_I2C_STATE_SLAVE_BUSY_RX, keep only HAL_I2C_STATE_LISTEN */
      hi2c->PreviousState = I2C_STATE_SLAVE_BUSY_RX;
      hi2c->State = HAL_I2C_STATE_LISTEN;
      hi2c->Mode = HAL_I2C_MODE_NONE;

      /* Process Unlocked */
      __HAL_UNLOCK(hi2c);
    }
  }
  else if(__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_ADDR) != RESET)
  {
    /* Disable ADDR interrupt to prevent multiple ADDRInterrupt*/
    /* Other ADDRInterrupt will be treat in next Listen usecase */
    if(hi2c->XferOptions != I2C_NO_OPTION_FRAME)
    {
      TransferDirection = I2C_GET_DIR(hi2c);
      SlaveAddrCode = I2C_GET_ADDR_MATCH(hi2c);
      OwnAdd1Code = I2C_GET_OWN_ADDRESS1(hi2c);
      OwnAdd2Code = I2C_GET_OWN_ADDRESS2(hi2c);

      /* If 10bits addressing mode is selected */
      if(hi2c->Init.AddressingMode == I2C_ADDRESSINGMODE_10BIT)
      {
        if((SlaveAddrCode & SlaveAddr_MSK) == ((OwnAdd1Code >> SlaveAddr_SHIFT) & SlaveAddr_MSK))
        {
          SlaveAddrCode = OwnAdd1Code;
          hi2c->AddrEventCount++;
          if(hi2c->AddrEventCount == 2)
          {
            /* Reset Address Event counter  */
            hi2c->AddrEventCount = 0;

